x = 38
print('дратути!')
if x < 0:
    print('Меньше нуля')
print("дотвидания!")

# examples
a, b = 10, 5

if a > b:
    print("a > b")

if a > b and a > 0:
    print("успех_1")

if (a > b) and (a > 0 or b < 1000):
    print("успех_2")

if 5 < b and b < 10:
    print("успех_3")

# сравнение чисел, списков, строк и др.

if "34" > "323":
    print("успех_4")

if "123" > "14":
    print("успеx_5")

if [1, 2] > [1, 3]:
    print("успех_6")

# нельзя сравнивать разные типы

# if "6" > 5:
#   print("успех_7")

# if [5, 6] > 5:
#    print("успех_8")

# но

if "6" != 5:
    print("успех_9")