"""
Самостоятельная работа по уроку "Цели и задачи. Поток выполнения программы. Как интерпретатор
показывает переменные."
1. Создайте новый проект
2. В файл main.py добавьте следующий код
print('Hi, PyCharm')
x = 43
y = 32
print(x * y)
print("End line")
Согласно скриншоту нажмите на самую первую строчку в коде на нумерации строк,
чтобы поставить точку остановки (breakpoint)
"""

print('Hi, PyCharm')
x = 43
y = 32
print(x * y)
print("End line")