"""             Форматирование строк
                team1 - Мастера кода
                team2 - Волшебники данных                """

"""____________Исходные данные_________"""
team1_num = 5
team2_num = 6
score_1 = 40
score_2 = 42
team1_time = 18015.2
team2_time = 2153.31451
tasks_total = 82
time_avg = 350.4
challenge_result = 'Победа команды Волшебники данных!'

###______________________________________Task_1_________________________________________________
###_____Использование %:
print('____________Task_1____________')
# team1_num = 5
# team2_num = 6
# в место вставки всегда пишем %s независимо от того, что вставляем

# В команде Мастера кода участников: 5!
print('В команде Мастера кода участников: %s!' % team1_num)


# Итого сегодня в командах участников: 5 и 6!
print('Итого сегодня в командах участников: %s и %s!' % (team1_num, team2_num))
# print('Итого сегодня в командах участников: %(team1_num)s и %(team2_num)s!' % {'team1_num': 5, 'team2_num': 6})
# print('Итого сегодня в командах участников: %d и %d!' % (team1_num, team2_num)) # ошибка если вместо d не int/float

###______________________________________Task_2_________________________________________________
###_____Использование format():
print('____________Task_2____________')
# score_2 = 42
# team1_time = 18015.2
print('Команда Волшебники данных решила задач: {}!'.format(score_2))
print('Волшебники данных решили задачи за {} с!'.format(team1_time))
# print('Волшебники данных решили задачи за {team1_time}, {team2_time} с!'.format(team1_time=18015.2, team2_time=11115.2))


###______________________________________Task_3_________________________________________________
###_____Использование f-строк:
print('____________Task_3____________')
# score_1 = 40
# score_2 = 42

# challenge_result:

if score_1 > score_2 or score_1 == score_2 and team1_time > team2_time:
    challenge_result = 'Победа команды Мастера кода!'
elif score_1 < score_2 or score_1 == score_2 and team1_time < team2_time:
    challenge_result = 'Победа команды Волшебники Данных!'
else:
    challenge_result = 'Ничья!'

# tasks_total = 82
# time_avg = 350.4

print(f'Команды решили {score_1} и {score_2} задач.')
print(f'Результат битвы: {challenge_result}')
print(f'Сегодня было решено {tasks_total} задач, в среднем по {time_avg} секунды на задачу!.')